#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ebench/cloud-infra-personnal-website-actions/runs/run-hxP2GhkKCxmyw38n

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # heroku_addon.papertrail will be created
  + resource "heroku_addon" "papertrail" {
      + app         = "personal-website-staging"
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "papertrail:choklad"
      + provider_id = (known after apply)
    }

  # heroku_addon_attachment.papertrail_attachment will be created
  + resource "heroku_addon_attachment" "papertrail_attachment" {
      + addon_id  = (known after apply)
      + app_id    = (known after apply)
      + id        = (known after apply)
      + name      = "PAPERTRAIL"
      + namespace = (known after apply)
    }

  # heroku_app.app_prod will be created
  + resource "heroku_app" "app_prod" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = {
          + "APP_ENVIRONMENT" = "prod"
        }
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "personal-website-prod"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_app.app_staging will be created
  + resource "heroku_app" "app_staging" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = {
          + "APP_ENVIRONMENT" = "staging"
        }
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "personal-website-staging"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_domain.domain_prod will be created
  + resource "heroku_domain" "domain_prod" {
      + app             = "personal-website-prod"
      + cname           = (known after apply)
      + hostname        = "www.elghali-benchekroun.com"
      + id              = (known after apply)
      + sni_endpoint_id = (known after apply)
    }

  # heroku_pipeline.main_pipeline will be created
  + resource "heroku_pipeline" "main_pipeline" {
      + id   = (known after apply)
      + name = "personal-website"

      + owner {
          + id   = (known after apply)
          + type = (known after apply)
        }
    }

  # heroku_pipeline_coupling.coupling_prod will be created
  + resource "heroku_pipeline_coupling" "coupling_prod" {
      + app      = (known after apply)
      + app_id   = (known after apply)
      + id       = (known after apply)
      + pipeline = (known after apply)
      + stage    = "production"
    }

  # heroku_pipeline_coupling.coupling_staging will be created
  + resource "heroku_pipeline_coupling" "coupling_staging" {
      + app      = (known after apply)
      + app_id   = (known after apply)
      + id       = (known after apply)
      + pipeline = (known after apply)
      + stage    = "staging"
    }

Plan: 8 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @elghali97, Action: `pull_request`*